const tourData =
    [
        {
            id: 1,
            mainTitle: 'Красоты урочища Хабю',
            textIntro: 'Поход на 3 дня',
            daysNumber: 3,
            day: 'дня',
            kilometersNumber: 35,
            hikeDifficulty: 3,
            maximumSeats: 10,
            priceAdult: 7000,
            priceKid: 5500,
            hikingDays: ['День 1.', 'День 2.', 'День 3.'],
            descriptionKeys: ['day1', 'day2', 'day3'],
            day1: `Перед стартом проверяем укладку снаряжения, подгоняем рюкзаки, проводим небольшой инструктаж и в путь! Начало маршрута в селе Ачандара, а конкретно стартуем от поляны Мидараадвы. Здесь растут три платана, один из которых достигает в высоту 49 метров, окружность 13,5 метров, под его кроной может разместиться до 500 человек, а его примерный возраст 800 лет. Осмотрев древние деревья - выходим на тропу! По пути у нас будет небольшая апацха (национальное абхазское кафе), где можно выпить кофе и перекусить. Продолжаем движение в сторону урочища. За каждым новым поворотом дороги открываются разнообразные впечатляющие виды - от панорамы на морское побережье до горной долины, где мы и разобьем стоянку. Готовим ужин, ставим, палатки, делимся впечатлениями за день у костра.`,
            day2: `Подъем в 7-8 утра. Завтрак, сбор стоянки. Двигаемся дальше! Следуем горной долиной к уникальному природному объекту - пещере Хабю, из нее проистекает одноименная речка. Протяженность исследованных ходов более 10 км. Пещера разделена на залы и галереи множеством сифонов. Первый зал доступен для посещения без специального оборудования, его мы и посетим. Вдоволь изучив пещеру следуем к водопадам Курочкина и Бычья голова. День будет насыщен разнообразием локаций и видов! Невероятная красота богатой абхазской природы потрясает, хочется запечатлеть все красоты маршрута, так что советуем хорошенько зарядить фото/видео гаджеты и пауэрбанки.`,
            day3: `Подъем в 7-8 утра. Завтрак, сбор стоянки. Финальный день. Не менее насыщенный и красочный. Идем к еще одному видовому месту - водопад Птичий. Нашему взору откроются красоты водопада и горная река Аапста. Возвращаемся в село Ачандара вдоль реки тенистыми тропами по самшитовым зарослям. Финальный привал в долине у реки. Садимся в джип и возвращаемся к месту встречи, Лыхнинский поворот, г.Гудаута. Индивидуальная развозка по отелям Абхазии/на границу – по договоренности за отдельную оплату.`
        },
        {
            id: 2,
            mainTitle: 'Гегский водопад-Пшегишхва-Рица',
            textIntro: 'Поход на 3 дня',
            daysNumber: 3,
            day: 'дня',
            kilometersNumber: 35,
            hikeDifficulty: 3,
            maximumSeats: 10,
            priceAdult: 8800,
            priceKid: 8250,
            hikingDays: ['День 1: ГЕГСКИЙ ВОДОПАД. ДОЛИНА РЕКИ ГЕГА', 'День 2: ВЕРШИНА ГОРЫ ПШЕГИШХВА 2216 М, ОЗЕРО МАЛАЯ РИЦА', 'День 3: ОЗЕРО РИЦА, МОЛОЧНЫЙ ВОДОПАД'],
            descriptionKeys: ['day1', 'day2', 'day3'],
            day1: `Наш поход мы начнем от величественного Гегского водопада. По пути к водопаду невозможно обделить вниманием такие красоты как Голубое озеро, водопады Девичьи слёзы и Мужские слезы. Местное название Гегского водопада - «Зоу», представляющего собой разветвленный водный поток, падающий с высоты около 50 метров. Это одна из самых ярких, зрелищных и легкодоступных достопримечательностей Абхазии. Гегский водопад находится в 4-5 км от основной дороги на озеро Рица. Водопад расположен в северных отрогах Гагрского хребта на высоте 530 метров над уровнем моря, в борту долины реки Гега, в 6 километрах от места её слияния с рекой Юпшара. Нам предстоит переправа через эту горную реку. Всем поклонникам Индиана Джонса и Джека Воробья точно придется по вкусу экстремальный вариант переправы в страховочной беседке по тросу, над бушующими потоками горной реки. Для менее отчаянных есть более спокойный переход через бревна. Безопасность с нашей стороны гарантирована в обоих случаях. Далее лесными, живописными тропами, мимо вековых реликтовых деревьев мы неуклонно поднимаемся на высоту 1900-2000 м. Где и станем лагерем неподалеку от охотничьего балагана. Ставим палатки, готовим ужин и делимся своими впечатлениями за день у костра.`,
            day2: `Подъем в 7.00. Завтракаем, собираем лагерь и в путь. Этот день ознаменуется штурмом горы Пшегишхва (2216 м). Набор высоты от нашего лагеря до вершины составит около 1000м. Каждые 100 м вы будете вынуждены остановиться, чтобы насладиться новыми фантастическими ракурсами, открывающимися перед нами. С вершины горы открываются впечатляющие виды на ущелье реки Бзыбь, озёра Малая и Большая Рица, весь Рицинский национальный парк с одной стороны и волшебное плато Арабика, вплоть до самого Бзыбского хребта с другой. Спуск с горы - это живописная тропа через альпийские луга, вековые ели и кедры, заросли тиса. С каждой видовой площадки будут открываться новые все более и более захватывающие ракурсы на озеро Рица, гору Пшегишхва плато Арабика и весь Гагрский хребет. Это неописуемая красота, умиротворение и величие гор! Ставим лагерь у великолепного уникального, ледникового озера Малая Рица, по своей красоте и великолепию окружающего пейзажа она ничем не уступает Рице. Оба озера возникли одновременно, вследствие одного и того же горного обвала. Малая Рица лежит в карстовой котловине на высоте свыше 1200м и образует неправильный овал, вытянутый в ширину больше, чем в длину. Протяженность ее примерно 200м, а глубина – около 100 м. Как и Рицу, Малую Рицу плотным кольцом окружают горы, чьи склоны густо поросли непроходимым пихтовым лесом. Озеро славится чистотой и прозрачностью своих вод, которые просматриваются на 18 м в глубину. Примечательного тем что оно более укромно, уютно и не так исхожено как район Большой Рицы. Ужин, посиделки у костра.`,
            day3: `Передвигаемся к финальной точке маршрута - озеро Большая Рица. Тут нас ждут эпичные виды гор и огромного ледникового озера. Обойдя озеро налюбовавшись его красотами, мы посетим еще одно прекрасное место - Молочный водопад. По желанию можно прокатиться по озеру на катамаране, испробовать национальных блюд в любом из понравившихся местных кафе. Вдоволь вкусив всех прелестей абхазской природной красоты и видов - отсюда нас заберет комфортабельный трансфер.`
        },
        {
            id: 3,
            mainTitle: 'Дикие тропы урочища Хипста',
            textIntro: 'Поход на 4 дня',
            daysNumber: 4,
            day: 'дня',
            kilometersNumber: 40,
            hikeDifficulty: 4,
            maximumSeats: 10,
            priceAdult: 9000,
            priceKid: '---',
            hikingDays: ['День 1.', 'День 2.', 'День 3.', 'День 4.'],
            descriptionKeys: ['day1', 'day2', 'day3', 'day4'],
            day1: `Перед стартом проверяем укладку снаряжения, подгоняем рюкзаки, проводим небольшой инструктаж и в путь! Транспорт доставит нас в предгорье Бзыбьского хребта. Отсюда начинаем движение по долине горной реки Хипста. Нас ждут величественные виды бурлящей горной реки, вершин Южного Кавказского хребта и разнообразие растительности реликтовых лесов. Ночуем в долине у реки. Готовим ужин, ставим, палатки, делимся впечатлениями за день у костра.`,
            day2: `Подъем в 7-8 утра. Завтрак, сбор стоянки. Продолжаем движение по долине реки, набирая высоту. Наша цель - альпийские луга, горные вершины Бзыбьского хребта. На высоте 2000 м нас ждет уже иной ландшафт - это царство альпийской растительности и величественных, захватывающих дух видов. С вершины открывается обзор на морское побережье Абхазии и горные долины. Ставим лагерь, распределяем обязанности по приготовлению пищи, заготовке дров и воды.`,
            day3: `Подъем в 7-8 утра. Завтрак, сбор стоянки. Сегодня день горных вершин и прогулок в облаках. Двигаемся по высотам от 2000 до 2400 метров. Штурмуем высшую точку нашего маршрута - гору Хипста, высота 2404 м! Далее двинемся к самой глубокой пещере мира -  пещера Веревкина. Спуск в пещеру возможен только при наличии альпинистского снаряжения, соответствующего опыта и официального разрешения. Но даже не спускаясь в саму пещеру, вид и объемы этого природного феномена впечатляет. Следуем через горный распадок Хипста, начинаем спуск. Следующая ночевка уже в тени растительности Кавказского предгорья. Ставим лагерь, распределяем обязанности по приготовлению пищи, заготовке дров и воды.`,
            day4: `Подъем в 7-8 утра. Завтрак, сбор стоянки. Крайний день похода. Лесными тропами и горными дорогами возвращаемся в цивилизацию. По пути заглянем к историческому, инженерному сооружению (секрет))) Доходим до села Дурипш, где нас ждет транспорт. Садимся в джип и возвращаемся к месту встречи, Лыхнинский поворот, г.Гудаута. Индивидуальная развозка по отелям Абхазии/на границу – по договоренности за отдельную оплату. Для тех, кто желает продлить отдых разбив палатку на морском побережье, доставим на пляж)`
        }
    ]

const tourGalleryData =
    [
        {
            id: 1,
            data: [
                {
                    link: 'images/tour/hike_1/02.jpg',
                    image: 'images/tour/hike_1/02.jpg'
                },
                {
                    link: 'images/tour/hike_1/03.jpg',
                    image: 'images/tour/hike_1/03.jpg'
                },
                {
                    link: 'images/tour/hike_1/04.jpg',
                    image: 'images/tour/hike_1/04.jpg'
                },
                {
                    link: 'images/tour/hike_1/05.jpg',
                    image: 'images/tour/hike_1/05.jpg'
                },
                {
                    link: 'images/tour/hike_1/06.jpg',
                    image: 'images/tour/hike_1/06.jpg'
                },
                {
                    link: 'images/tour/hike_1/07.jpg',
                    image: 'images/tour/hike_1/07.jpg'
                },
                {
                    link: 'images/tour/hike_1/08.jpg',
                    image: 'images/tour/hike_1/08.jpg'
                },
                {
                    link: 'images/tour/hike_1/09.jpg',
                    image: 'images/tour/hike_1/09.jpg'
                },
                {
                    link: 'images/tour/hike_1/10.jpg',
                    image: 'images/tour/hike_1/10.jpg'
                },
                {
                    link: 'images/tour/hike_1/11.jpg',
                    image: 'images/tour/hike_1/11.jpg'
                },
                {
                    link: 'images/tour/hike_1/12.jpg',
                    image: 'images/tour/hike_1/12.jpg'
                }
            ]
        },
        {
            id: 2,
            data: [
                {
                    link: 'images/tour/hike_2/02.jpg',
                    image: 'images/tour/hike_2/02.jpg'
                },
                {
                    link: 'images/tour/hike_2/03.jpg',
                    image: 'images/tour/hike_2/03.jpg'
                },
                {
                    link: 'images/tour/hike_2/04.jpg',
                    image: 'images/tour/hike_1/04.jpg'
                },
                {
                    link: 'images/tour/hike_2/05.jpg',
                    image: 'images/tour/hike_2/05.jpg'
                },
                {
                    link: 'images/tour/hike_2/06.jpg',
                    image: 'images/tour/hike_2/06.jpg'
                },
                {
                    link: 'images/tour/hike_2/07.jpg',
                    image: 'images/tour/hike_2/07.jpg'
                },
                {
                    link: 'images/tour/hike_2/08.jpg',
                    image: 'images/tour/hike_2/08.jpg'
                },
                {
                    link: 'images/tour/hike_2/09.jpg',
                    image: 'images/tour/hike_2/09.jpg'
                },
                {
                    link: 'images/tour/hike_2/10.jpg',
                    image: 'images/tour/hike_2/10.jpg'
                },
                {
                    link: 'images/tour/hike_2/11.jpg',
                    image: 'images/tour/hike_2/11.jpg'
                },
                {
                    link: 'images/tour/hike_2/12.jpg',
                    image: 'images/tour/hike_2/12.jpg'
                },
                {
                    link: 'images/tour/hike_2/14.jpg',
                    image: 'images/tour/hike_2/14.jpg'
                },
                {
                    link: 'images/tour/hike_2/15.jpg',
                    image: 'images/tour/hike_2/15.jpg'
                },
                {
                    link: 'images/tour/hike_2/16.jpg',
                    image: 'images/tour/hike_2/16.jpg'
                },
                {
                    link: 'images/tour/hike_2/17.jpg',
                    image: 'images/tour/hike_2/17.jpg'
                },
                {
                    link: 'images/tour/hike_2/18.jpg',
                    image: 'images/tour/hike_2/18.jpg'
                },
                {
                    link: 'images/tour/hike_2/19.jpg',
                    image: 'images/tour/hike_2/19.jpg'
                },
                {
                    link: 'images/tour/hike_2/20.jpg',
                    image: 'images/tour/hike_2/20.jpg'
                },
                {
                    link: 'images/tour/hike_2/21.jpg',
                    image: 'images/tour/hike_2/21.jpg'
                },
            ]
        },
        {
            id: 3,
            data: [
                {
                    link: 'images/tour/hike_3/02.jpg',
                    image: 'images/tour/hike_3/02.jpg'
                },
                {
                    link: 'images/tour/hike_3/03.jpg',
                    image: 'images/tour/hike_3/03.jpg'
                },
                {
                    link: 'images/tour/hike_3/04.jpg',
                    image: 'images/tour/hike_3/04.jpg'
                },
                {
                    link: 'images/tour/hike_3/05.jpg',
                    image: 'images/tour/hike_3/05.jpg'
                },
                {
                    link: 'images/tour/hike_3/06.jpg',
                    image: 'images/tour/hike_3/06.jpg'
                },
                {
                    link: 'images/tour/hike_3/07.jpg',
                    image: 'images/tour/hike_3/07.jpg'
                }
            ]
        }
    ]

const getTourTitle = (data) => {
    return `<header class="major">
                <h1>${data.mainTitle}</h1>
            </header>
            <div class="content">
                <p>${data.textIntro}</p>
            </div>`
}

const getTourDescription = (data) => {
    return `<section class="tour-icons">
                <div class="tour-item">
                    <h5>Длительность</h5>
                    <div class="tour-days">
                        <p class="icon solid fa-calendar-day"></p>
                        <p>${data.daysNumber}</p>
                        <p>${data.day}</p>
                    </div>
                </div>
                <div class="tour-item">
                    <h5>Длина</h5>
                    <div class="tour-days">
                        <p class="icon solid fa-route"></p>
                        <p>${data.kilometersNumber}</p>
                        <p>км</p>
                    </div>
                </div>
                <div class="tour-item">
                    <h5>Сложность</h5>
                    <div class="tour-days">
                        <p class="icon solid fa-hiking"></p>
                        <p>${data.hikeDifficulty}</p>
                        <p>/5</p>
                    </div>
                </div>
                <div class="tour-item">
                    <h5>Максимум мест</h5>
                    <div class="tour-days">
                        <p class="icon solid fa-users"></p>
                        <p>${data.maximumSeats}</p>
                        <p>чел</p>
                    </div>
                </div>
                <div class="tour-item">
                    <h5>Цена взрослый</h5>
                    <div class="tour-days">
                        <p class="icon solid fa-user"></p>
                        <p>${data.priceAdult}</p>
                        <p>₽</p>
                    </div>
                </div>
                <div class="tour-item">
                    <h5>Цена детский</h5>
                    <div class="tour-days">
                        <p class="icon solid fa-child"></p>
                        <p>${data.priceKid}</p>
                        <p>₽</p>
                    </div>
                </div>
            </section>`
}

const getTourText = (data) => {
    let text = '';
    for (let i = 0; i < data.descriptionKeys.length; i++) {
        text = text + `<dl>
                            <dt>${data.hikingDays[i]}</dt>
                                <dd>
                                    <p>${data[data.descriptionKeys[i]]}</p>
                                </dd>
                       </dl>`
    }

    return text;
}

const addTourGallery = (id) => {
    let carouselData = tourGalleryData.find(item => item.id === Number(id))
    let images = carouselData.data.map(item => {
        return `<article>
                    <a href=${item.link} class="image">
                        <img src=${item.image} alt="" />
                    </a>
                    <div class="caption">
                        <ul class="actions fixed">
                            <li><span class="button small">Увеличить</span></li>
                        </ul>
                    </div>
                </article>`
    })

    let gallery = document.getElementById('tourGallery');
    gallery.innerHTML = images.toString().replaceAll('</article>,', '</article>');
}

const addTourInformation = () => {
    let id = localStorage.getItem("dikohodTour");
    let tour = tourData.find(item => item.id === Number(id));
    let title = document.getElementById('tourTitle');
    let iconsInformation = document.getElementById('tourIcons');
    let text = document.getElementById('tourText');
    title.innerHTML = getTourTitle(tour);
    iconsInformation.innerHTML = getTourDescription(tour);
    text.innerHTML = getTourText(tour);
    addTourGallery(id);
}

addTourInformation();

