const jeepTourData =
    [
        {
            id: 1,
            mainTitle: 'Гегский водопад. Рицинский национальный заповедник',
            textIntro: 'Водопады восточной Абхазии: Великан, Ирина, Святой и таинственный город Акармара.',
            daysNumber: 1,
            day: 'день',
            hikeDifficulty: 1,
            maximumSeats: 6,
            priceAdult: 2500,
            priceKid: 2200,
            priceJeep: 21000,
            takeWith: ['теплая удобная куртка, защищающая от ветра', 'удобная обувь, лучше всего трекинг, сменная обувь', 'дождевик (на всякий случай)'],
            tourDescription: ['Озеро Рица – самая популярная экскурсия в Абхазии. Это одно из чудес природы Страны души, по праву считающейся самой большой легендой Кавказа. Дорога на озеро Рица поднимается по ущелью реки Бзыбь, стиснутой высокими скалами. У начала ущелья — старинное селение Бзыбь, возле него на скале виднеются руины крепости IX века. На 16-м километре шоссе по пути к Рице находится Голубое озеро карстового происхождения. Его площадь всего 180 кв. м, но глубина доходит до 23 м. Поражает удивительно яркий голубой цвет прозрачной воды, который мало изменяется даже в ненастную погоду из-за отложений лазурита на дне.',
                'Далее наш путь пролегает через крутой подъем на Гегский водопад - высота около 70 метров. Расположен в северных отрогах Гагрского хребта на высоте 530 метров над уровнем моря. Сама дорога к водопаду очень впечатляет как невероятной красоты видами, так и виртуозным мастерством наших водителей, смело и безопасно преодолевающих крутой подъем по бездорожью. На съёмках фильма «Приключения Шерлока Холмса и доктора Ватсона» сцена схватки Холмса с профессором Мориарти была снята на фоне Гегского водопада. Здесь же снимались и сцены фильмов «Рикки-Тикки-Тави», «Спортлото-82».',
                'После прогулки у водопада, миллиона фоток и короткого пит-стопа спускаемся вниз и направляемся в Каменный мешок (Юпшарские ворота). За местом слияния рек Гега и Юпшара дорога входит в Юпшарское ущелье длиной 8 км, которое славится своей неповторимой красотой. Дорога по ущелью петляет все выше и выше и, наконец, резко сужается, образуя глубокий каньон — Юпшарские ворота.',
                'Движемся дальше, к жемчужине нашей экскурсии - озеро Рица. Протяженность озера составляет 2.5 км, наибольшая ширина – 870м, глубина на определенных участках достигает 150 м. Вода в Рице очень прозрачная, имеет насыщенный сине-зеленовато-голубой цвет, она не замерзает даже в самую холодную погоду. Благодаря рельефу окружающих гор озеро имеет неправильную форму. Делаем остановку на небольшой пикник. Вдоволь насладившись красавицей Рицей двигаемся дальше к Молочному водопаду. Горная речка, образующая Молочный водопад, берет начало посреди ледников горы Ацетук. Пересекая на пути множество подземных источников, ее вода обогащается минералами, а при падении с высоты пенится, бурлит и насыщается кислородом, наполняясь множеством миниатюрных пузырьков воздуха. Такая метаморфоза придает водопаду молочный оттенок.',
                '(По желанию можем заехать на дачу Сталина, в стоимость тура НЕ входит)'],
            includedPrice: ['Трансфер от граница с абхазской стороны, либо с любого города Абхазии',
            'Услуги гида',
            'Входной билет в рицинский национальный парк',
            'Дегустация меда и вина'],
            notIncludedPrice: ['Посещение дачи Сталина',
            'Тарзанка (катание по желанию, оплата на месте)',
            'Питание на туре']
        },
        {
            id: 2,
            mainTitle: 'Водопады восточной Абхазии. Затерянный город Акармара',
            textIntro: 'Водопады восточной Абхазии: Великан, Ирина, Святой и таинственный город Акармара',
            daysNumber: 1,
            day: 'день',
            hikeDifficulty: 1,
            maximumSeats: 6,
            priceAdult: 3500,
            priceKid: 3000,
            priceJeep: 25000,
            takeWith: ['теплая удобная куртка, защищающая от ветра', 'удобная обувь, лучше всего трекинг, сменная обувь', 'дождевик (на всякий случай)'],
            tourDescription: ['Мы отправимся в удивительную и самобытную восточную часть Абхазии, которая притягивает искушенных путешественников.',
                'Водопады и Акармара располагаются в 12 км от города Ткуарчал – единственного крупного города Абхазии, не имеющего выхода к морю. Не так давно, в советское время, Ткуарчал был богатым промышленным центром страны, а ныне заброшенная Акармара – богатейшим шахтерским городом с невероятной архитектурой и бьющей ключом жизнью. Война Абхазии и Грузии (1992-1993 гг.) унесла жизнь из Акармары и от былого величия почти ничего не осталось. В городе до сих пор проживают несколько семей, поэтому при прогулке по Акармаре, будьте вежливы и обращайте внимание на таблички, написанные местными жителями.',
                'После прогулки по Акармаре грузимся в джипы и направляемся к водопадам. Первым нас встретит водопад Святой, высота около 38 метров. Красивый ниспадающий поток воды устремляется вниз, переходя в горную речку.',
                'Следующим нас встречает великолепный водопад Ирина – высота около 40 метров. Водопад назвали в честь матери известного альпиниста, открывшего удобную тропу к водопаду, Арлана Какубава. Благодаря этому человеку путешественники в 2017 году получили возможность увидеть это невероятное чудо природы. Водопад широкий и довольно бурный не пересыхает даже летом. Струящиеся каскадом жемчужных нитей, потоки воды завораживают и прекрасно освежают в летний зной!',
                'Водопады пополняются за счет ледников Кодогорского хребта. Эти льды не тают полностью, поэтому подпитка водоемов не прекращается. Поток воды от Ирины в виде небольшой речки протекает по неширокому руслу и примерно через 150 м низвергается вниз со скалы высотой 100 метров. Это и есть одна из жемчужин Абхазии – водопад Великан. Мощный, бурлящий поток воды, с оглушающим ревом обрушивается вниз. При первом взгляде на Великан перехватывает дыхание и время останавливается. Это единственный из трех водопадов под потоком которого пролегает тропа. Проходя по ней, мы оказываемся, фактически, под покровом этого гиганта!',
                'Водопады восточной Абхазии стоят того, чтобы до них добраться. Это сказочное творение самой природы оставить неизгладимое впечатление и перевернет Ваше представление об Абхазии и ее многообразии красот.',
                'После столь насыщенного путешествия по желанию можно расслабиться в термальных источниках села Кындык и поужинать в Апацхе (кафе национальной Абхазской кухни).',
                '* возможен индивидуальный заказ джипа'],
            includedPrice: ['Трансфер от граница с абхазской стороны, либо с любого города Абхазии',
            'Услуги гида',
            'Входные билеты на водопады'],
            notIncludedPrice: ['Сероводородный источник (по желанию)',
            'Питание на туре']
        },
        {
            id: 3,
            mainTitle: 'Совершенный мир. Долина 7 озёр, 2500м над уровнем моря',
            textIntro: 'Джип-тур в Долину 7 озёр - это невероятный дивный мир величественной и неповторимой абхазской природы. Здесь потрясающе красиво, а кристально чистый воздух просто кружит голову! Это дикий уголок, оплот гармонии и вдохновения вдали от суеты цивилизованного мира.',
            daysNumber: 1,
            day: 'день',
            hikeDifficulty: 1,
            maximumSeats: 6,
            priceAdult: 3500,
            priceKid: 3000,
            priceJeep: 22000,
            takeWith: ['теплая удобная куртка, защищающая от ветра', 'удобная обувь, лучше всего трекинг, сменная обувь', 'дождевик (на всякий случай)', 'легкий перекус+вода'],
            tourDescription: ['Путь в Долину 7 озер или Агура адзикуа – это экстремальное путешествие по горной дороге до перевала Пыв. Здесь, на высоте 2050м над уровнем моря раскинулись Альпийские луга, взору открывается вид на главный Кавказский хребет. Альпийские луга в Долине 7 озёр относятся к вечно-зеленым и поражают разнообразием растительности, кристально чистым воздухом, невероятным запахом цветов и трав. Весной, во время цветения, по склонам расстилается фантастический красочный ковер высокогорной растительности. На перевале есть несколько балаганов где можно отведать настоящий горный мед, домашний сыр, чай, из трав, собранных на альпийских лугах, вино и чачу. Здесь же, по желанию, можно взять лошадь и подняться на озёра верхом.',
                'Оставляем джип и начинаем подъём (около 7км) в Долину 7 озёр на высоту 2450м над уровнем моря. На самом деле водоёмов здесь гораздо больше – примерно вдвое. Но 14 озёр появляются не всегда, а только в период активного таяния снегов и сезона дождей.',
                'Самое огромное и впечатляющее – озеро Султан Идзиа. Существует трогательная история названия этого озера, когда-то мужчина с таким именем, потерявший ногу во время войны, поспорил с друзьями, что переплывет водоём и с успехом сделал это. Озеро решили назвать в его честь.',
                'Астолдзы или Столовое озеро – также очень известно и любимо туристами. Название озера полностью отражает его внешний вид – посередине озера виднеется небольшой каменный островок в виде округлого столика. Самые смелые и закаленный могут искупаться в ледниковых озёрах.'],
            includedPrice: ['Трансфер от граница с абхазской стороны, либо с любого города Абхазии',
                'Услуги гида',
                'Входной билет в рицинский национальный парк',
                'Дегустация меда и вина'],
            notIncludedPrice: ['Посещение дачи Сталина',
                'Питание на туре']
        },
        {
            id: 4,
            mainTitle: 'Вершина горы Мамзышха, 1873м над уровнем моря',
            textIntro: 'Джип-тур на вершину Мамзышхи (1873м) это невероятно красивый, захватывающий дух, маршрут с видами на горы и море. Пешая часть маршрута не сложная и доступна для туристов любого возраста и уровня физической подготовки.',
            daysNumber: 1,
            day: 'день',
            hikeDifficulty: 1,
            maximumSeats: 6,
            priceAdult: 2000,
            priceKid: 1700,
            priceJeep: 25000,
            takeWith: ['теплая удобная куртка, защищающая от ветра', 'удобная обувь, лучше всего трекинг, сменная обувь', 'дождевик (на всякий случай)'],
            tourDescription: ['Мы отправимся в сказочное приключение, по дороге останавливаясь на нескольких смотровых площадках и завершим нашу поездку пикником в горах. С каждой смотровой площадки вы будете видеть новый, захватывающий дух, ракурс. К вершине горы ведет узкая асфальтированная дорога протяженностью 30 км.',
                'Первая смотровая площадка возвышается на уровне 300 метров, отсюда виден мыс Пицунда, лесные массивы среднего горного пояса, где произрастают преимущественно дубы, грабы, бук, кавказская липа, каштан.',
                'Вторая смотровая площадка расположена на высоте 900 метров над уровнем моря у ущелья реки Цихерва. Третья смотровая площадка находится на высоте 1456 метров над уровнем моря. Летом отсюда можно спуститься на параплане прямо к пляжу, а зимой насладиться захватывающим видом на море и Гагру. Еще выше можно встретить леса из кавказской ели, пихты, альпийские луга, за которыми виднеются заснеженные горы. Такие невероятной красоты места можно встретить только в высокогорных регионах. По пути на вершину Мамдзышхи нам встретятся охотничьи и пастушьи балаганы. В летний сезон там можно остановиться на несколько дней и окунуться в мир покоя и тишины.',
                'Наша конечная точка - вершина горы Мамдзышха (1873м). Оттуда открывается панорама Гагрского, Бзыбского, Кавказского хребта, Черного моря, Сочи, горы Арабика, ущелий рек Пицунда и Бзыбь.',
                'Мы поднимемся на самую вершину горы, она представляет собой пологий холм с триангуляционной вышкой. Вдоволь налюбовавшись великолепными видами и обойдя всю вершину горы, обзор на все 360, мы спустимся в один из распадков, спрятавшись от ветра, где приготовим кофе, глинтвейн и перекус. После продолжим спуск к транспорту живописными, горными тропами.'],
            includedPrice: ['Трансфер от граница с абхазской стороны, либо с любого города Абхазии',
                'Услуги гида'],
            notIncludedPrice: ['Питание на туре']
        },
        {
            id: 5,
            mainTitle: 'Озеро Мзы. Альпийские луга, 2200м над уровнем моря',
            textIntro: '',
            daysNumber: 1,
            day: 'день',
            hikeDifficulty: 1,
            maximumSeats: 6,
            priceAdult: 3500,
            priceKid: 3000,
            priceJeep: 25000,
            takeWith: ['теплая удобная куртка, защищающая от ветра', 'удобная обувь, лучше всего трекинг, сменная обувь', 'дождевик (на всякий случай)'],
            tourDescription: ['Высокогорное озеро Мзы располагается в удивительно живописном месте среди альпийских лугов, окруженное каменной чашей горных вершин. По пути на озеро Мзы мы посетим все достопримечательности рицинского национального парка:',
                '- голубое озеро,',
                '- Водопады мужские и девичьи слезы,',
                '- Гегский водопад,',
                '- Юпшарские ворота,',
                '- смотровая “Прощай Родина”,',
                '- Озеро Рица',
                'Вдоволь насладившись красавицей Рицей двигаемся в сторону Ауадхары. По пути нам встретиться источник с самой настоящей газированной минеральной водой, бьющей прямо из горы! Дальше нас ждет очень живописная дорога к озеру Мзы. До самого озера проезда нет, оставив транспорт, спешиваемся и поднимаемся на озеро пешком либо на лошадях (протяженность пешего маршрута около 7 км)',
                'Размер озера небольшой, всего 100 на 45 м, зато глубина варьируется от 16 до 40 м. Оно образовано из вод таящих ледников, поэтому его размер и температура зависит от времени года, но обычно вода здесь редко бывает выше 4 градусов тепла, так что купаться в нем способны только самые отважные и закаленные путешественники. Даже летом здесь прохладно и можно встретить снежные островки, поэтому следует брать с собой теплые вещи и дождевики.',
                'Поднявшись на вершину, остановимся на небольшой пикник. Передохнув, начинаем спуск вниз к джипу, уставшие, но полные впечатлений и невероятных эмоций возвращаемся назад.'],
            includedPrice: ['Трансфер от граница с абхазской стороны, либо с любого города Абхазии',
                'Услуги гида',
                'Входной билет в рицинский национальный парк',
                'Дегустация меда и вина'],
            notIncludedPrice: ['Посещение дачи Сталина',
                'Подъем на озеро на лошадях',
                'Питание на туре']
        }
    ]

const jeeptourGalleryData =
    [
        {
            id: 1,
            data: [
                {
                    link: 'images/jeepTours/tour_1/03.jpg',
                    image: 'images/jeepTours/tour_1/03.jpg'
                },
                {
                    link: 'images/jeepTours/tour_1/04.jpg',
                    image: 'images/jeepTours/tour_1/04.jpg'
                },
                {
                    link: 'images/jeepTours/tour_1/05.jpg',
                    image: 'images/jeepTours/tour_1/05.jpg'
                },
                {
                    link: 'images/jeepTours/tour_1/06.jpg',
                    image: 'images/jeepTours/tour_1/06.jpg'
                },
                {
                    link: 'images/jeepTours/tour_1/07.jpg',
                    image: 'images/jeepTours/tour_1/07.jpg'
                },
                {
                    link: 'images/jeepTours/tour_1/08.jpg',
                    image: 'images/jeepTours/tour_1/08.jpg'
                },
                {
                    link: 'images/jeepTours/tour_1/09.jpg',
                    image: 'images/jeepTours/tour_1/09.jpg'
                },
                {
                    link: 'images/jeepTours/tour_1/10.jpg',
                    image: 'images/jeepTours/tour_1/10.jpg'
                },
                {
                    link: 'images/jeepTours/tour_1/11.jpg',
                    image: 'images/jeepTours/tour_1/11.jpg'
                }
            ]
        },
        {
            id: 2,
            data: [
                {
                    link: 'images/jeepTours/tour_2/02.jpg',
                    image: 'images/jeepTours/tour_2/02.jpg'
                },
                {
                    link: 'images/jeepTours/tour_2/03.jpg',
                    image: 'images/jeepTours/tour_2/03.jpg'
                },
                {
                    link: 'images/jeepTours/tour_2/04.jpg',
                    image: 'images/jeepTours/tour_2/04.jpg'
                },
                {
                    link: 'images/jeepTours/tour_2/05.jpg',
                    image: 'images/jeepTours/tour_2/05.jpg'
                },
                {
                    link: 'images/jeepTours/tour_2/06.jpg',
                    image: 'images/jeepTours/tour_2/06.jpg'
                },
                {
                    link: 'images/jeepTours/tour_2/07.jpg',
                    image: 'images/jeepTours/tour_2/07.jpg'
                },
                {
                    link: 'images/jeepTours/tour_2/08.jpg',
                    image: 'images/jeepTours/tour_2/08.jpg'
                },
                {
                    link: 'images/jeepTours/tour_2/09.jpg',
                    image: 'images/jeepTours/tour_2/09.jpg'
                },
                {
                    link: 'images/jeepTours/tour_2/10.jpg',
                    image: 'images/jeepTours/tour_2/10.jpg'
                },
                {
                    link: 'images/jeepTours/tour_2/11.jpg',
                    image: 'images/jeepTours/tour_2/11.jpg'
                },
                {
                    link: 'images/jeepTours/tour_2/12.jpg',
                    image: 'images/jeepTours/tour_2/12.jpg'
                },
                {
                    link: 'images/jeepTours/tour_2/13.jpg',
                    image: 'images/jeepTours/tour_2/13.jpg'
                }
            ]
        },
        {
            id: 3,
            data: [
                {
                    link: 'images/jeepTours/tour_3/02.jpg',
                    image: 'images/jeepTours/tour_3/02.jpg'
                },
                {
                    link: 'images/jeepTours/tour_3/03.jpg',
                    image: 'images/jeepTours/tour_3/03.jpg'
                },
                {
                    link: 'images/jeepTours/tour_3/04.jpg',
                    image: 'images/jeepTours/tour_3/04.jpg'
                },
                {
                    link: 'images/jeepTours/tour_3/05.jpg',
                    image: 'images/jeepTours/tour_3/05.jpg'
                },
                {
                    link: 'images/jeepTours/tour_3/06.jpg',
                    image: 'images/jeepTours/tour_3/06.jpg'
                },
                {
                    link: 'images/jeepTours/tour_3/07.jpg',
                    image: 'images/jeepTours/tour_3/07.jpg'
                },
                {
                    link: 'images/jeepTours/tour_3/08.jpg',
                    image: 'images/jeepTours/tour_3/08.jpg'
                },
                {
                    link: 'images/jeepTours/tour_3/09.jpg',
                    image: 'images/jeepTours/tour_3/09.jpg'
                },
                {
                    link: 'images/jeepTours/tour_3/10.jpg',
                    image: 'images/jeepTours/tour_3/10.jpg'
                },
                {
                    link: 'images/jeepTours/tour_3/11.jpg',
                    image: 'images/jeepTours/tour_3/11.jpg'
                },
                {
                    link: 'images/jeepTours/tour_3/12.jpg',
                    image: 'images/jeepTours/tour_3/12.jpg'
                },
                {
                    link: 'images/jeepTours/tour_3/13.jpg',
                    image: 'images/jeepTours/tour_3/13.jpg'
                }
            ]
        },
        {
            id: 4,
            data: [
                {
                    link: 'images/jeepTours/tour_4/02.jpg',
                    image: 'images/jeepTours/tour_4/02.jpg'
                },
                {
                    link: 'images/jeepTours/tour_4/03.jpg',
                    image: 'images/jeepTours/tour_4/03.jpg'
                },
                {
                    link: 'images/jeepTours/tour_4/04.jpg',
                    image: 'images/jeepTours/tour_4/04.jpg'
                },
                {
                    link: 'images/jeepTours/tour_4/05.jpg',
                    image: 'images/jeepTours/tour_4/05.jpg'
                },
                {
                    link: 'images/jeepTours/tour_4/06.jpg',
                    image: 'images/jeepTours/tour_4/06.jpg'
                },
                {
                    link: 'images/jeepTours/tour_4/07.jpg',
                    image: 'images/jeepTours/tour_4/07.jpg'
                },
                {
                    link: 'images/jeepTours/tour_4/08.jpg',
                    image: 'images/jeepTours/tour_4/08.jpg'
                },
                {
                    link: 'images/jeepTours/tour_4/09.jpg',
                    image: 'images/jeepTours/tour_4/09.jpg'
                }
            ]
        },
        {
            id: 5,
            data: [
                {
                    link: 'images/jeepTours/tour_5/02.jpg',
                    image: 'images/jeepTours/tour_5/02.jpg'
                },
                {
                    link: 'images/jeepTours/tour_5/03.jpg',
                    image: 'images/jeepTours/tour_5/03.jpg'
                },
                {
                    link: 'images/jeepTours/tour_5/04.jpg',
                    image: 'images/jeepTours/tour_5/04.jpg'
                },
                {
                    link: 'images/jeepTours/tour_5/05.jpg',
                    image: 'images/jeepTours/tour_5/05.jpg'
                },
                {
                    link: 'images/jeepTours/tour_5/06.jpg',
                    image: 'images/jeepTours/tour_5/06.jpg'
                },
                {
                    link: 'images/jeepTours/tour_5/07.jpg',
                    image: 'images/jeepTours/tour_5/07.jpg'
                },
                {
                    link: 'images/jeepTours/tour_5/08.jpg',
                    image: 'images/jeepTours/tour_5/08.jpg'
                },
                {
                    link: 'images/jeepTours/tour_5/09.jpg',
                    image: 'images/jeepTours/tour_5/09.jpg'
                },
                {
                    link: 'images/jeepTours/tour_5/10.jpg',
                    image: 'images/jeepTours/tour_5/10.jpg'
                },
                {
                    link: 'images/jeepTours/tour_5/11.jpg',
                    image: 'images/jeepTours/tour_5/11.jpg'
                }
            ]
        }
    ]

const getTourTitle = (data) => {
    return `<header class="major">
                <h1>${data.mainTitle}</h1>
            </header>
            <div class="content">
                <p>${data.textIntro}</p>
            </div>`
}

const getTourDescription = (data) => {
    return `<section class="tour-icons">
                <div class="tour-item">
                    <h5>Длительность</h5>
                    <div class="tour-days">
                        <p class="icon solid fa-calendar-day"></p>
                        <p>${data.daysNumber}</p>
                        <p>${data.day}</p>
                    </div>
                </div>
                <div class="tour-item">
                    <h5>Сложность</h5>
                    <div class="tour-days">
                        <p class="icon solid fa-hiking"></p>
                        <p>${data.hikeDifficulty}</p>
                        <p>/5</p>
                    </div>
                </div>
                <div class="tour-item">
                    <h5>Максимум мест</h5>
                    <div class="tour-days">
                        <p class="icon solid fa-users"></p>
                        <p>${data.maximumSeats}</p>
                        <p>чел</p>
                    </div>
                </div>
                <div class="tour-item">
                    <h5>Цена взрослый</h5>
                    <div class="tour-days">
                        <p class="icon solid fa-user"></p>
                        <p>${data.priceAdult}</p>
                        <p>₽</p>
                    </div>
                </div>
                <div class="tour-item">
                    <h5>Цена детский</h5>
                    <div class="tour-days">
                        <p class="icon solid fa-child"></p>
                        <p>${data.priceKid}</p>
                        <p>₽</p>
                    </div>
                </div>
                <div class="tour-item">
                    <h5>Заказ джипа*</h5>
                    <div class="tour-days">
                        <p class="icon solid fa-truck-monster"></p>
                        <p>${data.priceJeep}</p>
                        <p>₽</p>
                    </div>
                </div>
            </section>`
}

const getTourText = (data) => {
    let summaryTake = data.takeWith.reduce((tips, tip) => {
        tips += `<li>${tip}</li>`
        return tips
    }, '')

    let summaryIncludedPrice = data.includedPrice.reduce((tips, tip) => {
        tips += `<li>${tip}</li>`
        return tips
    }, '')

    let summaryNotIncludedPrice = data.notIncludedPrice.reduce((tips, tip) => {
        tips += `<li>${tip}</li>`
        return tips
    }, '')

    let text = ''
    for (let i = 0; i < data.tourDescription.length; i++){
        text += `<li style="margin-bottom:1rem">${data.tourDescription[i]}</li>`
    }

    return `<ul class="jeeping-list"> Что взять с собой: 
                ${summaryTake} 
           </ul>
           <ul style="list-style-type:none;">
                ${text}
           </ul>
           <ul class="jeeping-list"> Что входит в стоимость: 
                ${summaryIncludedPrice} 
           </ul>
           <ul class="jeeping-list"> Что не входит в стоимость: 
                ${summaryNotIncludedPrice} 
           </ul>`
}

const addJeeptourGallery = (id) => {
    let carouselData = jeeptourGalleryData.find(item => item.id === Number(id))
    let images = carouselData.data.map(item => {
        return `<article>
                    <a href=${item.link} class="image">
                        <img src=${item.image} alt="" />
                    </a>
                    <div class="caption">
                        <ul class="actions fixed">
                            <li><span class="button small">Увеличить</span></li>
                        </ul>
                    </div>
                </article>`
    })

    let gallery = document.getElementById('jeeptourGallery');
    gallery.innerHTML = images.toString().replaceAll('</article>,', '</article>');
}

const addTourInformation = () => {
    let id = localStorage.getItem("dikohodJeepTour");
    let tour = jeepTourData.find(item => item.id === Number(id));
    let title = document.getElementById('jeepTourTitle');
    let iconsInformation = document.getElementById('jeepTourIcons');
    let text = document.getElementById('jeepTourText');
    title.innerHTML = getTourTitle(tour);
    iconsInformation.innerHTML = getTourDescription(tour);
    text.innerHTML = getTourText(tour);
    addJeeptourGallery(id);
}

addTourInformation();